# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Temp\FHV_MEM_2016WS_EmbeddedSystems\Microcontroller\PSoC\Lab02\Lab02.cydsn\Lab02.cyprj
# Date: Thu, 13 Oct 2016 15:22:55 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 100000 -waveform {0 50000} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFCLK} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 4801 9601} [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Temp\FHV_MEM_2016WS_EmbeddedSystems\Microcontroller\PSoC\Lab02\Lab02.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Temp\FHV_MEM_2016WS_EmbeddedSystems\Microcontroller\PSoC\Lab02\Lab02.cydsn\Lab02.cyprj
# Date: Thu, 13 Oct 2016 15:22:53 GMT
